tinyrtx/pic16f/docs/pic16f1847 reference.h
// Register: APFCON0
extern volatile unsigned char           APFCON0             @ 0x11D;
#ifndef _LIB_BUILD
asm("APFCON0 equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1SEL                :1;
        unsigned P1CSEL                 :1;
        unsigned P1DSEL                 :1;
        unsigned CCP2SEL                :1;
        unsigned P2BSEL                 :1;
        unsigned SS1SEL                 :1;
        unsigned SDO1SEL                :1;
        unsigned RXDTSEL                :1;
    };
} APFCON0bits_t;
extern volatile APFCON0bits_t APFCON0bits @ 0x11D;
// bitfield macros
#define _APFCON0_CCP1SEL_POSN                               0x0
#define _APFCON0_CCP1SEL_POSITION                           0x0
#define _APFCON0_CCP1SEL_SIZE                               0x1
#define _APFCON0_CCP1SEL_LENGTH                             0x1
#define _APFCON0_CCP1SEL_MASK                               0x1
#define _APFCON0_P1CSEL_POSN                                0x1
#define _APFCON0_P1CSEL_POSITION                            0x1
#define _APFCON0_P1CSEL_SIZE                                0x1
#define _APFCON0_P1CSEL_LENGTH                              0x1
#define _APFCON0_P1CSEL_MASK                                0x2
#define _APFCON0_P1DSEL_POSN                                0x2
#define _APFCON0_P1DSEL_POSITION                            0x2
#define _APFCON0_P1DSEL_SIZE                                0x1
#define _APFCON0_P1DSEL_LENGTH                              0x1
#define _APFCON0_P1DSEL_MASK                                0x4
#define _APFCON0_CCP2SEL_POSN                               0x3
#define _APFCON0_CCP2SEL_POSITION                           0x3
#define _APFCON0_CCP2SEL_SIZE                               0x1
#define _APFCON0_CCP2SEL_LENGTH                             0x1
#define _APFCON0_CCP2SEL_MASK                               0x8
#define _APFCON0_P2BSEL_POSN                                0x4
#define _APFCON0_P2BSEL_POSITION                            0x4
#define _APFCON0_P2BSEL_SIZE                                0x1
#define _APFCON0_P2BSEL_LENGTH                              0x1
#define _APFCON0_P2BSEL_MASK                                0x10
#define _APFCON0_SS1SEL_POSN                                0x5
#define _APFCON0_SS1SEL_POSITION                            0x5
#define _APFCON0_SS1SEL_SIZE                                0x1
#define _APFCON0_SS1SEL_LENGTH                              0x1
#define _APFCON0_SS1SEL_MASK                                0x20
#define _APFCON0_SDO1SEL_POSN                               0x6
#define _APFCON0_SDO1SEL_POSITION                           0x6
#define _APFCON0_SDO1SEL_SIZE                               0x1
#define _APFCON0_SDO1SEL_LENGTH                             0x1
#define _APFCON0_SDO1SEL_MASK                               0x40
#define _APFCON0_RXDTSEL_POSN                               0x7
#define _APFCON0_RXDTSEL_POSITION                           0x7
#define _APFCON0_RXDTSEL_SIZE                               0x1
#define _APFCON0_RXDTSEL_LENGTH                             0x1
#define _APFCON0_RXDTSEL_MASK                               0x80

// Register: APFCON1
extern volatile unsigned char           APFCON1             @ 0x11E;
#ifndef _LIB_BUILD
asm("APFCON1 equ 011Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCKSEL                :1;
    };
} APFCON1bits_t;
extern volatile APFCON1bits_t APFCON1bits @ 0x11E;
// bitfield macros
#define _APFCON1_TXCKSEL_POSN                               0x0
#define _APFCON1_TXCKSEL_POSITION                           0x0
#define _APFCON1_TXCKSEL_SIZE                               0x1
#define _APFCON1_TXCKSEL_LENGTH                             0x1
#define _APFCON1_TXCKSEL_MASK                               0x1

// Register: ANSELA
extern volatile unsigned char           ANSELA              @ 0x18C;
#ifndef _LIB_BUILD
asm("ANSELA equ 018Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned ANSA3                  :1;
        unsigned ANSA4                  :1;
    };
    struct {
        unsigned ANSELA                 :5;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits @ 0x18C;
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA3_POSN                                  0x3
#define _ANSELA_ANSA3_POSITION                              0x3
#define _ANSELA_ANSA3_SIZE                                  0x1
#define _ANSELA_ANSA3_LENGTH                                0x1
#define _ANSELA_ANSA3_MASK                                  0x8
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSELA_POSN                                 0x0
#define _ANSELA_ANSELA_POSITION                             0x0
#define _ANSELA_ANSELA_SIZE                                 0x5
#define _ANSELA_ANSELA_LENGTH                               0x5
#define _ANSELA_ANSELA_MASK                                 0x1F

// Register: ANSELB
extern volatile unsigned char           ANSELB              @ 0x18D;
#ifndef _LIB_BUILD
asm("ANSELB equ 018Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned ANSB1                  :1;
        unsigned ANSB2                  :1;
        unsigned ANSB3                  :1;
        unsigned ANSB4                  :1;
        unsigned ANSB5                  :1;
        unsigned ANSB6                  :1;
        unsigned ANSB7                  :1;
    };
    struct {
        unsigned ANSELB                 :8;
    };
} ANSELBbits_t;
extern volatile ANSELBbits_t ANSELBbits @ 0x18D;
// bitfield macros
#define _ANSELB_ANSB1_POSN                                  0x1
#define _ANSELB_ANSB1_POSITION                              0x1
#define _ANSELB_ANSB1_SIZE                                  0x1
#define _ANSELB_ANSB1_LENGTH                                0x1
#define _ANSELB_ANSB1_MASK                                  0x2
#define _ANSELB_ANSB2_POSN                                  0x2
#define _ANSELB_ANSB2_POSITION                              0x2
#define _ANSELB_ANSB2_SIZE                                  0x1
#define _ANSELB_ANSB2_LENGTH                                0x1
#define _ANSELB_ANSB2_MASK                                  0x4
#define _ANSELB_ANSB3_POSN                                  0x3
#define _ANSELB_ANSB3_POSITION                              0x3
#define _ANSELB_ANSB3_SIZE                                  0x1
#define _ANSELB_ANSB3_LENGTH                                0x1
#define _ANSELB_ANSB3_MASK                                  0x8
#define _ANSELB_ANSB4_POSN                                  0x4
#define _ANSELB_ANSB4_POSITION                              0x4
#define _ANSELB_ANSB4_SIZE                                  0x1
#define _ANSELB_ANSB4_LENGTH                                0x1
#define _ANSELB_ANSB4_MASK                                  0x10
#define _ANSELB_ANSB5_POSN                                  0x5
#define _ANSELB_ANSB5_POSITION                              0x5
#define _ANSELB_ANSB5_SIZE                                  0x1
#define _ANSELB_ANSB5_LENGTH                                0x1
#define _ANSELB_ANSB5_MASK                                  0x20
#define _ANSELB_ANSB6_POSN                                  0x6
#define _ANSELB_ANSB6_POSITION                              0x6
#define _ANSELB_ANSB6_SIZE                                  0x1
#define _ANSELB_ANSB6_LENGTH                                0x1
#define _ANSELB_ANSB6_MASK                                  0x40
#define _ANSELB_ANSB7_POSN                                  0x7
#define _ANSELB_ANSB7_POSITION                              0x7
#define _ANSELB_ANSB7_SIZE                                  0x1
#define _ANSELB_ANSB7_LENGTH                                0x1
#define _ANSELB_ANSB7_MASK                                  0x80
#define _ANSELB_ANSELB_POSN                                 0x0
#define _ANSELB_ANSELB_POSITION                             0x0
#define _ANSELB_ANSELB_SIZE                                 0x8
#define _ANSELB_ANSELB_LENGTH                               0x8
#define _ANSELB_ANSELB_MASK                                 0xFF

// Register: EEADR
extern volatile unsigned short          EEADR               @ 0x191;
#ifndef _LIB_BUILD
asm("EEADR equ 0191h");
#endif

// Register: EEADRL
extern volatile unsigned char           EEADRL              @ 0x191;
#ifndef _LIB_BUILD
asm("EEADRL equ 0191h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRL                 :8;
    };
} EEADRLbits_t;
extern volatile EEADRLbits_t EEADRLbits @ 0x191;
// bitfield macros
#define _EEADRL_EEADRL_POSN                                 0x0
#define _EEADRL_EEADRL_POSITION                             0x0
#define _EEADRL_EEADRL_SIZE                                 0x8
#define _EEADRL_EEADRL_LENGTH                               0x8
#define _EEADRL_EEADRL_MASK                                 0xFF

// Register: EEADRH
extern volatile unsigned char           EEADRH              @ 0x192;
#ifndef _LIB_BUILD
asm("EEADRH equ 0192h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EEADRH                 :7;
    };
} EEADRHbits_t;
extern volatile EEADRHbits_t EEADRHbits @ 0x192;
// bitfield macros
#define _EEADRH_EEADRH_POSN                                 0x0
#define _EEADRH_EEADRH_POSITION                             0x0
#define _EEADRH_EEADRH_SIZE                                 0x7
#define _EEADRH_EEADRH_LENGTH                               0x7
#define _EEADRH_EEADRH_MASK                                 0x7F

