tinyrtx/pic16f/docs/pic16f1847 reference.h
// Register: MDSRC
extern volatile unsigned char           MDSRC               @ 0x39D;
#ifndef _LIB_BUILD
asm("MDSRC equ 039Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDMS0                  :1;
        unsigned MDMS1                  :1;
        unsigned MDMS2                  :1;
        unsigned MDMS3                  :1;
        unsigned                        :3;
        unsigned MDMSODIS               :1;
    };
    struct {
        unsigned MDMS                   :4;
    };
} MDSRCbits_t;
extern volatile MDSRCbits_t MDSRCbits @ 0x39D;
// bitfield macros
#define _MDSRC_MDMS0_POSN                                   0x0
#define _MDSRC_MDMS0_POSITION                               0x0
#define _MDSRC_MDMS0_SIZE                                   0x1
#define _MDSRC_MDMS0_LENGTH                                 0x1
#define _MDSRC_MDMS0_MASK                                   0x1
#define _MDSRC_MDMS1_POSN                                   0x1
#define _MDSRC_MDMS1_POSITION                               0x1
#define _MDSRC_MDMS1_SIZE                                   0x1
#define _MDSRC_MDMS1_LENGTH                                 0x1
#define _MDSRC_MDMS1_MASK                                   0x2
#define _MDSRC_MDMS2_POSN                                   0x2
#define _MDSRC_MDMS2_POSITION                               0x2
#define _MDSRC_MDMS2_SIZE                                   0x1
#define _MDSRC_MDMS2_LENGTH                                 0x1
#define _MDSRC_MDMS2_MASK                                   0x4
#define _MDSRC_MDMS3_POSN                                   0x3
#define _MDSRC_MDMS3_POSITION                               0x3
#define _MDSRC_MDMS3_SIZE                                   0x1
#define _MDSRC_MDMS3_LENGTH                                 0x1
#define _MDSRC_MDMS3_MASK                                   0x8
#define _MDSRC_MDMSODIS_POSN                                0x7
#define _MDSRC_MDMSODIS_POSITION                            0x7
#define _MDSRC_MDMSODIS_SIZE                                0x1
#define _MDSRC_MDMSODIS_LENGTH                              0x1
#define _MDSRC_MDMSODIS_MASK                                0x80
#define _MDSRC_MDMS_POSN                                    0x0
#define _MDSRC_MDMS_POSITION                                0x0
#define _MDSRC_MDMS_SIZE                                    0x4
#define _MDSRC_MDMS_LENGTH                                  0x4
#define _MDSRC_MDMS_MASK                                    0xF

// Register: MDCARL
extern volatile unsigned char           MDCARL              @ 0x39E;
#ifndef _LIB_BUILD
asm("MDCARL equ 039Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCL0                  :1;
        unsigned MDCL1                  :1;
        unsigned MDCL2                  :1;
        unsigned MDCL3                  :1;
        unsigned                        :1;
        unsigned MDCLSYNC               :1;
        unsigned MDCLPOL                :1;
        unsigned MDCLODIS               :1;
    };
    struct {
        unsigned MDCL                   :4;
    };
} MDCARLbits_t;
extern volatile MDCARLbits_t MDCARLbits @ 0x39E;
// bitfield macros
#define _MDCARL_MDCL0_POSN                                  0x0
#define _MDCARL_MDCL0_POSITION                              0x0
#define _MDCARL_MDCL0_SIZE                                  0x1
#define _MDCARL_MDCL0_LENGTH                                0x1
#define _MDCARL_MDCL0_MASK                                  0x1
#define _MDCARL_MDCL1_POSN                                  0x1
#define _MDCARL_MDCL1_POSITION                              0x1
#define _MDCARL_MDCL1_SIZE                                  0x1
#define _MDCARL_MDCL1_LENGTH                                0x1
#define _MDCARL_MDCL1_MASK                                  0x2
#define _MDCARL_MDCL2_POSN                                  0x2
#define _MDCARL_MDCL2_POSITION                              0x2
#define _MDCARL_MDCL2_SIZE                                  0x1
#define _MDCARL_MDCL2_LENGTH                                0x1
#define _MDCARL_MDCL2_MASK                                  0x4
#define _MDCARL_MDCL3_POSN                                  0x3
#define _MDCARL_MDCL3_POSITION                              0x3
#define _MDCARL_MDCL3_SIZE                                  0x1
#define _MDCARL_MDCL3_LENGTH                                0x1
#define _MDCARL_MDCL3_MASK                                  0x8
#define _MDCARL_MDCLSYNC_POSN                               0x5
#define _MDCARL_MDCLSYNC_POSITION                           0x5
#define _MDCARL_MDCLSYNC_SIZE                               0x1
#define _MDCARL_MDCLSYNC_LENGTH                             0x1
#define _MDCARL_MDCLSYNC_MASK                               0x20
#define _MDCARL_MDCLPOL_POSN                                0x6
#define _MDCARL_MDCLPOL_POSITION                            0x6
#define _MDCARL_MDCLPOL_SIZE                                0x1
#define _MDCARL_MDCLPOL_LENGTH                              0x1
#define _MDCARL_MDCLPOL_MASK                                0x40
#define _MDCARL_MDCLODIS_POSN                               0x7
#define _MDCARL_MDCLODIS_POSITION                           0x7
#define _MDCARL_MDCLODIS_SIZE                               0x1
#define _MDCARL_MDCLODIS_LENGTH                             0x1
#define _MDCARL_MDCLODIS_MASK                               0x80
#define _MDCARL_MDCL_POSN                                   0x0
#define _MDCARL_MDCL_POSITION                               0x0
#define _MDCARL_MDCL_SIZE                                   0x4
#define _MDCARL_MDCL_LENGTH                                 0x4
#define _MDCARL_MDCL_MASK                                   0xF

// Register: MDCARH
extern volatile unsigned char           MDCARH              @ 0x39F;
#ifndef _LIB_BUILD
asm("MDCARH equ 039Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCH0                  :1;
        unsigned MDCH1                  :1;
        unsigned MDCH2                  :1;
        unsigned MDCH3                  :1;
        unsigned                        :1;
        unsigned MDCHSYNC               :1;
        unsigned MDCHPOL                :1;
        unsigned MDCHODIS               :1;
    };
    struct {
        unsigned MDCH                   :4;
    };
} MDCARHbits_t;
extern volatile MDCARHbits_t MDCARHbits @ 0x39F;
// bitfield macros
#define _MDCARH_MDCH0_POSN                                  0x0
#define _MDCARH_MDCH0_POSITION                              0x0
#define _MDCARH_MDCH0_SIZE                                  0x1
#define _MDCARH_MDCH0_LENGTH                                0x1
#define _MDCARH_MDCH0_MASK                                  0x1
#define _MDCARH_MDCH1_POSN                                  0x1
#define _MDCARH_MDCH1_POSITION                              0x1
#define _MDCARH_MDCH1_SIZE                                  0x1
#define _MDCARH_MDCH1_LENGTH                                0x1
#define _MDCARH_MDCH1_MASK                                  0x2
#define _MDCARH_MDCH2_POSN                                  0x2
#define _MDCARH_MDCH2_POSITION                              0x2
#define _MDCARH_MDCH2_SIZE                                  0x1
#define _MDCARH_MDCH2_LENGTH                                0x1
#define _MDCARH_MDCH2_MASK                                  0x4
#define _MDCARH_MDCH3_POSN                                  0x3
#define _MDCARH_MDCH3_POSITION                              0x3
#define _MDCARH_MDCH3_SIZE                                  0x1
#define _MDCARH_MDCH3_LENGTH                                0x1
#define _MDCARH_MDCH3_MASK                                  0x8
#define _MDCARH_MDCHSYNC_POSN                               0x5
#define _MDCARH_MDCHSYNC_POSITION                           0x5
#define _MDCARH_MDCHSYNC_SIZE                               0x1
#define _MDCARH_MDCHSYNC_LENGTH                             0x1
#define _MDCARH_MDCHSYNC_MASK                               0x20
#define _MDCARH_MDCHPOL_POSN                                0x6
#define _MDCARH_MDCHPOL_POSITION                            0x6
#define _MDCARH_MDCHPOL_SIZE                                0x1
#define _MDCARH_MDCHPOL_LENGTH                              0x1
#define _MDCARH_MDCHPOL_MASK                                0x40
#define _MDCARH_MDCHODIS_POSN                               0x7
#define _MDCARH_MDCHODIS_POSITION                           0x7
#define _MDCARH_MDCHODIS_SIZE                               0x1
#define _MDCARH_MDCHODIS_LENGTH                             0x1
#define _MDCARH_MDCHODIS_MASK                               0x80
#define _MDCARH_MDCH_POSN                                   0x0
#define _MDCARH_MDCH_POSITION                               0x0
#define _MDCARH_MDCH_SIZE                                   0x4
#define _MDCARH_MDCH_LENGTH                                 0x4
#define _MDCARH_MDCH_MASK                                   0xF

// Register: TMR4
extern volatile unsigned char           TMR4                @ 0x415;
#ifndef _LIB_BUILD
asm("TMR4 equ 0415h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4                   :8;
    };
} TMR4bits_t;
