tinyrtx/pic16f/docs/pic16f1847 reference.h
extern volatile __bit                   MDMS2               @ (((unsigned) &MDSRC)*8) + 2;
#define                                 MDMS2_bit           BANKMASK(MDSRC), 2
extern volatile __bit                   MDMS3               @ (((unsigned) &MDSRC)*8) + 3;
#define                                 MDMS3_bit           BANKMASK(MDSRC), 3
extern volatile __bit                   MDMSODIS            @ (((unsigned) &MDSRC)*8) + 7;
#define                                 MDMSODIS_bit        BANKMASK(MDSRC), 7
extern volatile __bit                   MDOE                @ (((unsigned) &MDCON)*8) + 6;
#define                                 MDOE_bit            BANKMASK(MDCON), 6
extern volatile __bit                   MDOPOL              @ (((unsigned) &MDCON)*8) + 4;
#define                                 MDOPOL_bit          BANKMASK(MDCON), 4
extern volatile __bit                   MDOUT               @ (((unsigned) &MDCON)*8) + 3;
#define                                 MDOUT_bit           BANKMASK(MDCON), 3
extern volatile __bit                   MDSLR               @ (((unsigned) &MDCON)*8) + 5;
#define                                 MDSLR_bit           BANKMASK(MDCON), 5
extern volatile __bit                   MFIOFR              @ (((unsigned) &OSCSTAT)*8) + 2;
#define                                 MFIOFR_bit          BANKMASK(OSCSTAT), 2
extern volatile __bit                   OERR                @ (((unsigned) &RCSTA)*8) + 1;
#define                                 OERR_bit            BANKMASK(RCSTA), 1
extern volatile __bit                   OSFIE               @ (((unsigned) &PIE2)*8) + 7;
#define                                 OSFIE_bit           BANKMASK(PIE2), 7
extern volatile __bit                   OSFIF               @ (((unsigned) &PIR2)*8) + 7;
#define                                 OSFIF_bit           BANKMASK(PIR2), 7
extern volatile __bit                   OSTS                @ (((unsigned) &OSCSTAT)*8) + 5;
#define                                 OSTS_bit            BANKMASK(OSCSTAT), 5
extern volatile __bit                   P1CSEL              @ (((unsigned) &APFCON0)*8) + 1;
#define                                 P1CSEL_bit          BANKMASK(APFCON0), 1
extern volatile __bit                   P1DC0               @ (((unsigned) &PWM1CON)*8) + 0;
#define                                 P1DC0_bit           BANKMASK(PWM1CON), 0
extern volatile __bit                   P1DC1               @ (((unsigned) &PWM1CON)*8) + 1;
#define                                 P1DC1_bit           BANKMASK(PWM1CON), 1
extern volatile __bit                   P1DC2               @ (((unsigned) &PWM1CON)*8) + 2;
#define                                 P1DC2_bit           BANKMASK(PWM1CON), 2
extern volatile __bit                   P1DC3               @ (((unsigned) &PWM1CON)*8) + 3;
#define                                 P1DC3_bit           BANKMASK(PWM1CON), 3
extern volatile __bit                   P1DC4               @ (((unsigned) &PWM1CON)*8) + 4;
#define                                 P1DC4_bit           BANKMASK(PWM1CON), 4
extern volatile __bit                   P1DC5               @ (((unsigned) &PWM1CON)*8) + 5;
#define                                 P1DC5_bit           BANKMASK(PWM1CON), 5
extern volatile __bit                   P1DC6               @ (((unsigned) &PWM1CON)*8) + 6;
#define                                 P1DC6_bit           BANKMASK(PWM1CON), 6
extern volatile __bit                   P1DSEL              @ (((unsigned) &APFCON0)*8) + 2;
#define                                 P1DSEL_bit          BANKMASK(APFCON0), 2
extern volatile __bit                   P1M0                @ (((unsigned) &CCP1CON)*8) + 6;
#define                                 P1M0_bit            BANKMASK(CCP1CON), 6
extern volatile __bit                   P1M1                @ (((unsigned) &CCP1CON)*8) + 7;
#define                                 P1M1_bit            BANKMASK(CCP1CON), 7
extern volatile __bit                   P1RSEN              @ (((unsigned) &PWM1CON)*8) + 7;
#define                                 P1RSEN_bit          BANKMASK(PWM1CON), 7
extern volatile __bit                   P2BSEL              @ (((unsigned) &APFCON0)*8) + 4;
#define                                 P2BSEL_bit          BANKMASK(APFCON0), 4
extern volatile __bit                   P2DC0               @ (((unsigned) &PWM2CON)*8) + 0;
#define                                 P2DC0_bit           BANKMASK(PWM2CON), 0
extern volatile __bit                   P2DC1               @ (((unsigned) &PWM2CON)*8) + 1;
#define                                 P2DC1_bit           BANKMASK(PWM2CON), 1
extern volatile __bit                   P2DC2               @ (((unsigned) &PWM2CON)*8) + 2;
#define                                 P2DC2_bit           BANKMASK(PWM2CON), 2
extern volatile __bit                   P2DC3               @ (((unsigned) &PWM2CON)*8) + 3;
#define                                 P2DC3_bit           BANKMASK(PWM2CON), 3
extern volatile __bit                   P2DC4               @ (((unsigned) &PWM2CON)*8) + 4;
#define                                 P2DC4_bit           BANKMASK(PWM2CON), 4
extern volatile __bit                   P2DC5               @ (((unsigned) &PWM2CON)*8) + 5;
#define                                 P2DC5_bit           BANKMASK(PWM2CON), 5
extern volatile __bit                   P2DC6               @ (((unsigned) &PWM2CON)*8) + 6;
#define                                 P2DC6_bit           BANKMASK(PWM2CON), 6
extern volatile __bit                   P2M0                @ (((unsigned) &CCP2CON)*8) + 6;
#define                                 P2M0_bit            BANKMASK(CCP2CON), 6
extern volatile __bit                   P2M1                @ (((unsigned) &CCP2CON)*8) + 7;
#define                                 P2M1_bit            BANKMASK(CCP2CON), 7
extern volatile __bit                   P2RSEN              @ (((unsigned) &PWM2CON)*8) + 7;
#define                                 P2RSEN_bit          BANKMASK(PWM2CON), 7
extern volatile __bit                   PEIE                @ (((unsigned) &INTCON)*8) + 6;
#define                                 PEIE_bit            BANKMASK(INTCON), 6
extern volatile __bit                   PLLR                @ (((unsigned) &OSCSTAT)*8) + 6;
#define                                 PLLR_bit            BANKMASK(OSCSTAT), 6
extern volatile __bit                   PS0                 @ (((unsigned) &OPTION_REG)*8) + 0;
#define                                 PS0_bit             BANKMASK(OPTION_REG), 0
extern volatile __bit                   PS1                 @ (((unsigned) &OPTION_REG)*8) + 1;
#define                                 PS1_bit             BANKMASK(OPTION_REG), 1
extern volatile __bit                   PS2                 @ (((unsigned) &OPTION_REG)*8) + 2;
#define                                 PS2_bit             BANKMASK(OPTION_REG), 2
extern volatile __bit                   PSA                 @ (((unsigned) &OPTION_REG)*8) + 3;
#define                                 PSA_bit             BANKMASK(OPTION_REG), 3
extern volatile __bit                   PSS1AC0             @ (((unsigned) &CCP1AS)*8) + 2;
#define                                 PSS1AC0_bit         BANKMASK(CCP1AS), 2
extern volatile __bit                   PSS1AC1             @ (((unsigned) &CCP1AS)*8) + 3;
#define                                 PSS1AC1_bit         BANKMASK(CCP1AS), 3
extern volatile __bit                   PSS1BD0             @ (((unsigned) &CCP1AS)*8) + 0;
#define                                 PSS1BD0_bit         BANKMASK(CCP1AS), 0
extern volatile __bit                   PSS1BD1             @ (((unsigned) &CCP1AS)*8) + 1;
#define                                 PSS1BD1_bit         BANKMASK(CCP1AS), 1
extern volatile __bit                   PSS2AC0             @ (((unsigned) &CCP2AS)*8) + 2;
#define                                 PSS2AC0_bit         BANKMASK(CCP2AS), 2
extern volatile __bit                   PSS2AC1             @ (((unsigned) &CCP2AS)*8) + 3;
#define                                 PSS2AC1_bit         BANKMASK(CCP2AS), 3
extern volatile __bit                   PSS2BD0             @ (((unsigned) &CCP2AS)*8) + 0;
#define                                 PSS2BD0_bit         BANKMASK(CCP2AS), 0
extern volatile __bit                   PSS2BD1             @ (((unsigned) &CCP2AS)*8) + 1;
#define                                 PSS2BD1_bit         BANKMASK(CCP2AS), 1
extern volatile __bit                   RA0                 @ (((unsigned) &PORTA)*8) + 0;
#define                                 RA0_bit             BANKMASK(PORTA), 0
extern volatile __bit                   RA1                 @ (((unsigned) &PORTA)*8) + 1;
#define                                 RA1_bit             BANKMASK(PORTA), 1
extern volatile __bit                   RA2                 @ (((unsigned) &PORTA)*8) + 2;
#define                                 RA2_bit             BANKMASK(PORTA), 2
extern volatile __bit                   RA3                 @ (((unsigned) &PORTA)*8) + 3;
#define                                 RA3_bit             BANKMASK(PORTA), 3
extern volatile __bit                   RA4                 @ (((unsigned) &PORTA)*8) + 4;
#define                                 RA4_bit             BANKMASK(PORTA), 4
extern volatile __bit                   RA5                 @ (((unsigned) &PORTA)*8) + 5;
#define                                 RA5_bit             BANKMASK(PORTA), 5
extern volatile __bit                   RA6                 @ (((unsigned) &PORTA)*8) + 6;
#define                                 RA6_bit             BANKMASK(PORTA), 6
extern volatile __bit                   RA7                 @ (((unsigned) &PORTA)*8) + 7;
#define                                 RA7_bit             BANKMASK(PORTA), 7
extern volatile __bit                   RB0                 @ (((unsigned) &PORTB)*8) + 0;
#define                                 RB0_bit             BANKMASK(PORTB), 0
extern volatile __bit                   RB1                 @ (((unsigned) &PORTB)*8) + 1;
#define                                 RB1_bit             BANKMASK(PORTB), 1
extern volatile __bit                   RB2                 @ (((unsigned) &PORTB)*8) + 2;
#define                                 RB2_bit             BANKMASK(PORTB), 2
extern volatile __bit                   RB3                 @ (((unsigned) &PORTB)*8) + 3;
#define                                 RB3_bit             BANKMASK(PORTB), 3
extern volatile __bit                   RB4                 @ (((unsigned) &PORTB)*8) + 4;
#define                                 RB4_bit             BANKMASK(PORTB), 4
extern volatile __bit                   RB5                 @ (((unsigned) &PORTB)*8) + 5;
#define                                 RB5_bit             BANKMASK(PORTB), 5
extern volatile __bit                   RB6                 @ (((unsigned) &PORTB)*8) + 6;
#define                                 RB6_bit             BANKMASK(PORTB), 6
extern volatile __bit                   RB7                 @ (((unsigned) &PORTB)*8) + 7;
#define                                 RB7_bit             BANKMASK(PORTB), 7
extern volatile __bit                   RCIDL               @ (((unsigned) &BAUDCON)*8) + 6;
#define                                 RCIDL_bit           BANKMASK(BAUDCON), 6
extern volatile __bit                   RCIE                @ (((unsigned) &PIE1)*8) + 5;
#define                                 RCIE_bit            BANKMASK(PIE1), 5
extern volatile __bit                   RCIF                @ (((unsigned) &PIR1)*8) + 5;
#define                                 RCIF_bit            BANKMASK(PIR1), 5
extern volatile __bit                   RD                  @ (((unsigned) &EECON1)*8) + 0;
#define                                 RD_bit              BANKMASK(EECON1), 0
extern volatile __bit                   RX9                 @ (((unsigned) &RCSTA)*8) + 6;
#define                                 RX9_bit             BANKMASK(RCSTA), 6
extern volatile __bit                   RX9D                @ (((unsigned) &RCSTA)*8) + 0;
#define                                 RX9D_bit            BANKMASK(RCSTA), 0
extern volatile __bit                   RXDTSEL             @ (((unsigned) &APFCON0)*8) + 7;
#define                                 RXDTSEL_bit         BANKMASK(APFCON0), 7
extern volatile __bit                   SBOREN              @ (((unsigned) &BORCON)*8) + 7;
#define                                 SBOREN_bit          BANKMASK(BORCON), 7
extern volatile __bit                   SCKP                @ (((unsigned) &BAUDCON)*8) + 4;
#define                                 SCKP_bit            BANKMASK(BAUDCON), 4
extern volatile __bit                   SCS0                @ (((unsigned) &OSCCON)*8) + 0;
#define                                 SCS0_bit            BANKMASK(OSCCON), 0
extern volatile __bit                   SCS1                @ (((unsigned) &OSCCON)*8) + 1;
#define                                 SCS1_bit            BANKMASK(OSCCON), 1
extern volatile __bit                   SDO1SEL             @ (((unsigned) &APFCON0)*8) + 6;
#define                                 SDO1SEL_bit         BANKMASK(APFCON0), 6
extern volatile __bit                   SENDB               @ (((unsigned) &TXSTA)*8) + 3;
#define                                 SENDB_bit           BANKMASK(TXSTA), 3
extern volatile __bit                   SPEN                @ (((unsigned) &RCSTA)*8) + 7;
#define                                 SPEN_bit            BANKMASK(RCSTA), 7
extern volatile __bit                   SPLLEN              @ (((unsigned) &OSCCON)*8) + 7;
#define                                 SPLLEN_bit          BANKMASK(OSCCON), 7
extern volatile __bit                   SRCLK0              @ (((unsigned) &SRCON0)*8) + 4;
#define                                 SRCLK0_bit          BANKMASK(SRCON0), 4
extern volatile __bit                   SRCLK1              @ (((unsigned) &SRCON0)*8) + 5;
#define                                 SRCLK1_bit          BANKMASK(SRCON0), 5
extern volatile __bit                   SRCLK2              @ (((unsigned) &SRCON0)*8) + 6;
#define                                 SRCLK2_bit          BANKMASK(SRCON0), 6
extern volatile __bit                   SREN                @ (((unsigned) &RCSTA)*8) + 5;
#define                                 SREN_bit            BANKMASK(RCSTA), 5
extern volatile __bit                   SRLEN               @ (((unsigned) &SRCON0)*8) + 7;
#define                                 SRLEN_bit           BANKMASK(SRCON0), 7
extern volatile __bit                   SRNQEN              @ (((unsigned) &SRCON0)*8) + 2;
#define                                 SRNQEN_bit          BANKMASK(SRCON0), 2
extern volatile __bit                   SRPR                @ (((unsigned) &SRCON0)*8) + 0;
#define                                 SRPR_bit            BANKMASK(SRCON0), 0
extern volatile __bit                   SRPS                @ (((unsigned) &SRCON0)*8) + 1;
#define                                 SRPS_bit            BANKMASK(SRCON0), 1
extern volatile __bit                   SRQEN               @ (((unsigned) &SRCON0)*8) + 3;
#define                                 SRQEN_bit           BANKMASK(SRCON0), 3
extern volatile __bit                   SRRC1E              @ (((unsigned) &SRCON1)*8) + 0;
#define                                 SRRC1E_bit          BANKMASK(SRCON1), 0
extern volatile __bit                   SRRC2E              @ (((unsigned) &SRCON1)*8) + 1;
#define                                 SRRC2E_bit          BANKMASK(SRCON1), 1
extern volatile __bit                   SRRCKE              @ (((unsigned) &SRCON1)*8) + 2;
#define                                 SRRCKE_bit          BANKMASK(SRCON1), 2
extern volatile __bit                   SRRPE               @ (((unsigned) &SRCON1)*8) + 3;
#define                                 SRRPE_bit           BANKMASK(SRCON1), 3
extern volatile __bit                   SRSC1E              @ (((unsigned) &SRCON1)*8) + 4;
#define                                 SRSC1E_bit          BANKMASK(SRCON1), 4
extern volatile __bit                   SRSC2E              @ (((unsigned) &SRCON1)*8) + 5;
#define                                 SRSC2E_bit          BANKMASK(SRCON1), 5
extern volatile __bit                   SRSCKE              @ (((unsigned) &SRCON1)*8) + 6;
#define                                 SRSCKE_bit          BANKMASK(SRCON1), 6
extern volatile __bit                   SRSPE               @ (((unsigned) &SRCON1)*8) + 7;
#define                                 SRSPE_bit           BANKMASK(SRCON1), 7
extern volatile __bit                   SS1SEL              @ (((unsigned) &APFCON0)*8) + 5;
#define                                 SS1SEL_bit          BANKMASK(APFCON0), 5
extern volatile __bit                   SSP1IE              @ (((unsigned) &PIE1)*8) + 3;
#define                                 SSP1IE_bit          BANKMASK(PIE1), 3
extern volatile __bit                   SSP1IF              @ (((unsigned) &PIR1)*8) + 3;
#define                                 SSP1IF_bit          BANKMASK(PIR1), 3
extern volatile __bit                   SSP2IE              @ (((unsigned) &PIE4)*8) + 0;
#define                                 SSP2IE_bit          BANKMASK(PIE4), 0
extern volatile __bit                   SSP2IF              @ (((unsigned) &PIR4)*8) + 0;
#define                                 SSP2IF_bit          BANKMASK(PIR4), 0
extern volatile __bit                   STKOVF              @ (((unsigned) &PCON)*8) + 7;
#define                                 STKOVF_bit          BANKMASK(PCON), 7
extern volatile __bit                   STKUNF              @ (((unsigned) &PCON)*8) + 6;
#define                                 STKUNF_bit          BANKMASK(PCON), 6
extern volatile __bit                   STR1A               @ (((unsigned) &PSTR1CON)*8) + 0;
#define                                 STR1A_bit           BANKMASK(PSTR1CON), 0
extern volatile __bit                   STR1B               @ (((unsigned) &PSTR1CON)*8) + 1;
#define                                 STR1B_bit           BANKMASK(PSTR1CON), 1
extern volatile __bit                   STR1C               @ (((unsigned) &PSTR1CON)*8) + 2;
#define                                 STR1C_bit           BANKMASK(PSTR1CON), 2
extern volatile __bit                   STR1D               @ (((unsigned) &PSTR1CON)*8) + 3;
#define                                 STR1D_bit           BANKMASK(PSTR1CON), 3
extern volatile __bit                   STR1SYNC            @ (((unsigned) &PSTR1CON)*8) + 4;
#define                                 STR1SYNC_bit        BANKMASK(PSTR1CON), 4
extern volatile __bit                   STR2A               @ (((unsigned) &PSTR2CON)*8) + 0;
#define                                 STR2A_bit           BANKMASK(PSTR2CON), 0
extern volatile __bit                   STR2B               @ (((unsigned) &PSTR2CON)*8) + 1;
#define                                 STR2B_bit           BANKMASK(PSTR2CON), 1
extern volatile __bit                   STR2C               @ (((unsigned) &PSTR2CON)*8) + 2;
#define                                 STR2C_bit           BANKMASK(PSTR2CON), 2
extern volatile __bit                   STR2D               @ (((unsigned) &PSTR2CON)*8) + 3;
#define                                 STR2D_bit           BANKMASK(PSTR2CON), 3
extern volatile __bit                   STR2SYNC            @ (((unsigned) &PSTR2CON)*8) + 4;
#define                                 STR2SYNC_bit        BANKMASK(PSTR2CON), 4
extern volatile __bit                   SWDTEN              @ (((unsigned) &WDTCON)*8) + 0;
#define                                 SWDTEN_bit          BANKMASK(WDTCON), 0
extern volatile __bit                   SYNC                @ (((unsigned) &TXSTA)*8) + 4;
#define                                 SYNC_bit            BANKMASK(TXSTA), 4
extern volatile __bit                   T0CS                @ (((unsigned) &OPTION_REG)*8) + 5;
#define                                 T0CS_bit            BANKMASK(OPTION_REG), 5
extern volatile __bit                   T0IE                @ (((unsigned) &INTCON)*8) + 5;
#define                                 T0IE_bit            BANKMASK(INTCON), 5
extern volatile __bit                   T0IF                @ (((unsigned) &INTCON)*8) + 2;
#define                                 T0IF_bit            BANKMASK(INTCON), 2
extern volatile __bit                   T0SE                @ (((unsigned) &OPTION_REG)*8) + 4;
#define                                 T0SE_bit            BANKMASK(OPTION_REG), 4
extern volatile __bit                   T0XCS               @ (((unsigned) &CPSCON0)*8) + 0;
#define                                 T0XCS_bit           BANKMASK(CPSCON0), 0
extern volatile __bit                   T1CKPS0             @ (((unsigned) &T1CON)*8) + 4;
#define                                 T1CKPS0_bit         BANKMASK(T1CON), 4
extern volatile __bit                   T1CKPS1             @ (((unsigned) &T1CON)*8) + 5;
#define                                 T1CKPS1_bit         BANKMASK(T1CON), 5
extern volatile __bit                   T1GGO               @ (((unsigned) &T1GCON)*8) + 3;
#define                                 T1GGO_bit           BANKMASK(T1GCON), 3
extern volatile __bit                   T1GGO_nDONE         @ (((unsigned) &T1GCON)*8) + 3;
#define                                 T1GGO_nDONE_bit     BANKMASK(T1GCON), 3
extern volatile __bit                   T1GPOL              @ (((unsigned) &T1GCON)*8) + 6;
#define                                 T1GPOL_bit          BANKMASK(T1GCON), 6
extern volatile __bit                   T1GSPM              @ (((unsigned) &T1GCON)*8) + 4;
#define                                 T1GSPM_bit          BANKMASK(T1GCON), 4
extern volatile __bit                   T1GSS0              @ (((unsigned) &T1GCON)*8) + 0;
#define                                 T1GSS0_bit          BANKMASK(T1GCON), 0
extern volatile __bit                   T1GSS1              @ (((unsigned) &T1GCON)*8) + 1;
#define                                 T1GSS1_bit          BANKMASK(T1GCON), 1
extern volatile __bit                   T1GTM               @ (((unsigned) &T1GCON)*8) + 5;
#define                                 T1GTM_bit           BANKMASK(T1GCON), 5
extern volatile __bit                   T1GVAL              @ (((unsigned) &T1GCON)*8) + 2;
#define                                 T1GVAL_bit          BANKMASK(T1GCON), 2
extern volatile __bit                   T1OSCEN             @ (((unsigned) &T1CON)*8) + 3;
#define                                 T1OSCEN_bit         BANKMASK(T1CON), 3
extern volatile __bit                   T1OSCR              @ (((unsigned) &OSCSTAT)*8) + 7;
#define                                 T1OSCR_bit          BANKMASK(OSCSTAT), 7
extern volatile __bit                   T2CKPS0             @ (((unsigned) &T2CON)*8) + 0;
#define                                 T2CKPS0_bit         BANKMASK(T2CON), 0
extern volatile __bit                   T2CKPS1             @ (((unsigned) &T2CON)*8) + 1;
#define                                 T2CKPS1_bit         BANKMASK(T2CON), 1
extern volatile __bit                   T2OUTPS0            @ (((unsigned) &T2CON)*8) + 3;
#define                                 T2OUTPS0_bit        BANKMASK(T2CON), 3
extern volatile __bit                   T2OUTPS1            @ (((unsigned) &T2CON)*8) + 4;
#define                                 T2OUTPS1_bit        BANKMASK(T2CON), 4
extern volatile __bit                   T2OUTPS2            @ (((unsigned) &T2CON)*8) + 5;
